namespace Rock_Paper_Scissors
{
    internal class Program
    {

        public static void Hello()
        {
            Console.WriteLine("                        ________  ________  ________  ___  __                                               \r\n                       |\\   __  \\|\\   __  \\|\\   ____\\|\\  \\|\\  \\                                             \r\n                       \\ \\  \\|\\  \\ \\  \\|\\  \\ \\  \\___|\\ \\  \\/  /|_                                           \r\n                        \\ \\   _  _\\ \\  \\\\\\  \\ \\  \\    \\ \\   ___  \\                                          \r\n                         \\ \\  \\\\  \\\\ \\  \\\\\\  \\ \\  \\____\\ \\  \\\\ \\  \\                                         \r\n                          \\ \\__\\\\ _\\\\ \\_______\\ \\_______\\ \\__\\\\ \\__\\                                        \r\n                           \\|__|\\|__|\\|_______|\\|_______|\\|__| \\|__|                                        \r\n                                                                                                            \r\n                                                                                                            \r\n                                                                                                            \r\n                            ________  ________  ________  _______   ________                                \r\n                           |\\   __  \\|\\   __  \\|\\   __  \\|\\  ___ \\ |\\   __  \\                               \r\n                           \\ \\  \\|\\  \\ \\  \\|\\  \\ \\  \\|\\  \\ \\   __/|\\ \\  \\|\\  \\                              \r\n                            \\ \\   ____\\ \\   __  \\ \\   ____\\ \\  \\_|/_\\ \\   _  _\\                             \r\n                             \\ \\  \\___|\\ \\  \\ \\  \\ \\  \\___|\\ \\  \\_|\\ \\ \\  \\\\  \\|                            \r\n                              \\ \\__\\    \\ \\__\\ \\__\\ \\__\\    \\ \\_______\\ \\__\\\\ _\\                            \r\n                               \\|__|     \\|__|\\|__|\\|__|     \\|_______|\\|__|\\|__|                           \r\n                                                                                                            \r\n                                                                                                            \r\n                                                                                                            \r\n                            ________  ________  ___  ________   ________  ________  ________  ________      \r\n                           |\\   ____\\|\\   ____\\|\\  \\|\\   ____\\ |\\   ____\\|\\   __  \\|\\   __  \\|\\   ____\\     \r\n                           \\ \\  \\___|\\ \\  \\___|\\ \\  \\ \\  \\___|_\\ \\  \\___|\\ \\  \\|\\  \\ \\  \\|\\  \\ \\  \\___|_    \r\n                            \\ \\_____  \\ \\  \\    \\ \\  \\ \\_____  \\\\ \\_____  \\ \\  \\\\\\  \\ \\   _  _\\ \\_____  \\   \r\n                             \\|____|\\  \\ \\  \\____\\ \\  \\|____|\\  \\\\|____|\\  \\ \\  \\\\\\  \\ \\  \\\\  \\\\|____|\\  \\  \r\n                               ____\\_\\  \\ \\_______\\ \\__\\____\\_\\  \\ ____\\_\\  \\ \\_______\\ \\__\\\\ _\\ ____\\_\\  \\ \r\n                              |\\_________\\|_______|\\|__|\\_________\\\\_________\\|_______|\\|__|\\|__|\\_________\\\r\n                              \\|_________|             \\|_________\\|_________|                  \\|_________| \n");
        }
        public static void languageAndRules(string[] leng)
        {
            string frame = "===================================================================================================================================";

            Console.WriteLine($"\n{frame} \n→ Welcome to the game \"rock, scissors, paper\"! \n{frame} \r\n→ Before you start playing, select the game language, just write \"Eng\" or \"Ua\":");
            Console.Write($"→ ");
            string GameLanguageNL = Console.ReadLine();
            string GameLanguage = GameLanguageNL.ToLower();

            Console.WriteLine(frame);

            if (GameLanguage == "eng")
            {
                Console.WriteLine("→Ем... ну тут така поблема... мої знання англiйської закiнчилися ще на монулiй строчцi =( \n→Ну, буду сподiватися, що ти розумiєш українську =)");
            }
            else if (GameLanguage == "ua")
            {
                Console.WriteLine("→Чудово! Мова обрана!");
            }
            else
            {
                Console.WriteLine($"→I don't know \"{GameLanguageNL}\" language :( \nCan you try again?");
            }

            Console.WriteLine(frame);

            Console.WriteLine("\n _____                                                  _____ \r\n( ___ )------------------------------------------------( ___ )\r\n |   |                                                  |   | \r\n |   | $$$$$$$\\            $$\\                          |   | \r\n |   | $$  __$$\\           $$ |                         |   | \r\n |   | $$ |  $$ |$$\\   $$\\ $$ | $$$$$$\\   $$$$$$$\\ $$\\  |   | \r\n |   | $$$$$$$  |$$ |  $$ |$$ |$$  __$$\\ $$  _____|\\__| |   | \r\n |   | $$  __$$< $$ |  $$ |$$ |$$$$$$$$ |\\$$$$$$\\       |   | \r\n |   | $$ |  $$ |$$ |  $$ |$$ |$$   ____| \\____$$\\ $$\\  |   | \r\n |   | $$ |  $$ |\\$$$$$$  |$$ |\\$$$$$$$\\ $$$$$$$  |\\__| |   | \r\n |   | \\__|  \\__| \\______/ \\__| \\_______|\\_______/      |   | \r\n |___|                                                  |___| \r\n(_____)------------------------------------------------(_____)");

            Console.WriteLine($"\n \n{frame} \n→Правила простi:\n" +
                              "→Доступна зброя:\r\n\r\n→Камiнь\r\n→Ножицi\r\n→Папiр\r\n\n→Папiр перемагає над камiнням, але програє ножицям.\r\n→Ножицi перемагають над папером, але програють камiнню.\r\n→Камiння перемагає ножицi, але програє паперу.\r\n\n→Вiдбувається старт битви. Проти нас грає ШI, який обирає один iз видiв зброї, пiсля чого по правилах вище обирається переможець раунду.\r\n\r\n→Раундiв у нас ТРИ.\r\n→Пiсля третього раунду визначається переможець битви.\r\n\r\n→Бал за перемогу користувачу нараховується тiльки у випадку двох перемог i одного програшу, або трьох перемог та нулю програшiв за битву.\n→Грати можна тiльки з 12 років. \n→Щоб почати грати потрiбно пройти реєстрацiю.");
        }
        static void Main(string[] args)
        {
            Hello();

            languageAndRules(args);


        }
        public static void registration() { }
    }
}